БухЭксп/Catalogs/CW_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_НастройкиПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеДоступа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПраваДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецПраваДоступа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_НастройкиПользователей/Forms/ФормаСохраненияНастроек/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = CW_Настройки.Пользователь();
	
	// --- 
	
	Список.Параметры.Элементы[0].Значение = Параметры.КлючОбъекта;
	Список.Параметры.Элементы[0].Использование = Истина;
	Список.Параметры.Элементы[1].Значение = Пользователь;
	Список.Параметры.Элементы[1].Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	// --- 
	
	Если _сф.стр_Сократить(ИмяНастройки) <> "" Тогда
		
		// создаем новую настройку
		ЭтаФорма.Закрыть(СоздатьНовуюНастройку());
		
	Иначе
		
		Если Элементы.Список.ТекущиеДанные <> Неопределено  Тогда
			
			// --- 
			
			ЭтаФорма.Закрыть(Элементы.Список.ТекущаяСтрока);
			
			// --- 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
	
КонецПроцедуры

&НаСервере
Функция СоздатьНовуюНастройку()
	
	НоваяНастройка = Справочники.CW_НастройкиПользователей.СоздатьЭлемент();
	НоваяНастройка.КлючОбъекта = Параметры.КлючОбъекта;
	НоваяНастройка.Наименование = ИмяНастройки;
	НоваяНастройка.Пользователь = Пользователь;
	НоваяНастройка.Записать();
	
	Возврат(НоваяНастройка.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура Удалить(Команда)
	// --- 
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		
		// помечаем на удаление
		_УдалитьНастройку(Элементы.Список.ТекущаяСтрока);
		Элементы.Список.Обновить();

	КонецЕсли; 
		
	// --- 
КонецПроцедуры

&НаСервере
Процедура _УдалитьНастройку(Ссылка)
	// --- 
	
	Настройка = ССылка.ПолучитьОбъект();
	Настройка.УстановитьПометкуУдаления(Истина);
	
	// --- 
КонецПроцедуры
 
&НаКлиенте
Процедура Редактировать(Команда)
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Элементы.Список.ТекущаяСтрока));
		                                                                    		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
КонецПроцедуры
